## Data Loading, Storage

In [14]:
import pandas as pd

In [20]:
mydata = {
          'name' : ['Ali', 'Sara', 'Taha', 'Omid'], 
          'age'  : [27, 24, 25, 26], 
          'Score': [19, 18, 20, 13]
         }

In [21]:
mydf = pd.DataFrame(mydata, columns = ['name', 'age','Score'])
mydf

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

## CSV : Comma-separated values

In [24]:
mydf.to_csv('score.csv', index=False)

In [25]:
pd.read_csv('score.csv')

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

In [26]:
mydf.set_index("name",inplace=True)

In [31]:
pd.read_csv('score.csv').dtypes

name     object
age       int64
Score     int64
dtype: object

In [27]:
mydf

      age  Score
name
Ali    27     19
Sara   24     18
Taha   25     20
Omid   26     13

In [28]:
mydf.to_csv('score.csv')

### File without header

In [33]:
pd.read_csv('./Files/student.csv', header=None)

       0   1   2   3
0    Ali  12  20  18
1   Sara  13  14   6
2   Taha  12   8  19
3  Mahsa  20  16   9

In [34]:
pd.read_csv('./Files/student.csv', names=['name','Python', 'C++', 'Java'])

    name  Python  C++  Java
0    Ali      12   20    18
1   Sara      13   14     6
2   Taha      12    8    19
3  Mahsa      20   16     9

### skiprows

In [37]:
pd.read_csv('./Files/age.csv')

  #  Hello shirafkan
0     name       age
1      Ali        12
2     Sara        13
3     Taha        12
4    Mahsa        20

In [38]:
pd.read_csv('./Files/age.csv', skiprows=[0])

    name  age
0    Ali   12
1   Sara   13
2   Taha   12
3  Mahsa   20

In [39]:
pd.read_csv('./Files/age.csv', header=[1])

    name  age
0    Ali   12
1   Sara   13
2   Taha   12
3  Mahsa   20

### csv.reader

In [40]:
import csv

In [46]:
with open('./Files/score.csv') as f:
    x = list(csv.reader(f))
x

[['name', 'age', 'Score'],
 ['Ali', '27', '19'],
 ['Sara', '24', '18'],
 ['Taha', '25', '20'],
 ['Omid', '26', '13']]

In [47]:
print(x[0])

['name', 'age', 'Score']

In [48]:
print(x[1:])

[['Ali', '27', '19'], ['Sara', '24', '18'], ['Taha', '25', '20'], ['Omid', '26', '13']]

# read_table

In [49]:
pd.read_table('./Files/score.csv')

  name,age,Score
0      Ali,27,19
1     Sara,24,18
2     Taha,25,20
3     Omid,26,13

In [50]:
pd.read_table('./Files/score.csv', sep=',')

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

In [51]:
pd.read_table('./Files/mytext.txt', sep='\s+')

      A  B  C
row1  1  2  3
row2  4  5  6

### nrows , chunksize

In [18]:
path = 'd:Files/Alphabet.csv'

In [19]:
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
2     C     3
3     D     4
4     E     5
5     F     6
6     G     7
7     H     8
8     I     9
9     J    10
10    K    11
11    L    12
12    M    13
13    N    14
14    O    15
15    P    16
16    Q    17
17    R    18
18    S    19
19    T    20
20    U    21
21    V    22
22    W    23
23    X    24
24    Y    25
25    Z    26

In [20]:
pd.read_csv(path, nrows=8)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
4    E     5
5    F     6
6    G     7
7    H     8

In [21]:
pd.options.display.max_rows = 8
pd.read_csv(path)

   col1  col2
0     A     1
1     B     2
2     C     3
3     D     4
..  ...   ...
22    W    23
23    X    24
24    Y    25
25    Z    26

[26 rows x 2 columns]

In [22]:
pd.read_csv(path, skipfooter=24, engine='python')

  col1  col2
0    A     1
1    B     2

In [23]:
c = pd.read_csv(path, chunksize=8)

for i in c:
    print(i)

  col1  col2
0    A     1
1    B     2
2    C     3
3    D     4
4    E     5
5    F     6
6    G     7
7    H     8
   col1  col2
8     I     9
9     J    10
10    K    11
11    L    12
12    M    13
13    N    14
14    O    15
15    P    16
   col1  col2
16    Q    17
17    R    18
18    S    19
19    T    20
20    U    21
21    V    22
22    W    23
23    X    24
   col1  col2
24    Y    25
25    Z    26

### sys.stdout

In [24]:
import sys

In [25]:
mydata = pd.read_csv('d:Files/score.csv')

In [26]:
mydata.to_csv(sys.stdout)

,name,age,Score
0,Ali,27,19
1,Sara,24,18
2,Taha,25,20
3,Omid,26,13

In [27]:
mydata.to_csv(sys.stdout, index=False, header=False, sep='|')

Ali|27|19
Sara|24|18
Taha|25|20
Omid|26|13

## df.to_excel

In [28]:
# pip install openpyxl

In [29]:
mydf

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

In [30]:
mydf.to_excel('d:Files/score.xlsx', index=False)

In [31]:
pd.read_excel('d:Files/score.xlsx')

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

## JSON   : JavaScript Object Notation

In [32]:
import json

In [33]:
mystr = """
{
   "FirstName": "Taha",
   "Courses"  : [{"Name": "Python", "Score": 18}, {"Name": "C++", "Score": 17 }]
}
"""

In [34]:
mydict = json.loads(mystr)
frame = pd.DataFrame(mydict['Courses'], columns=['Name', 'Score'])
frame

     Name  Score
0  Python     18
1     C++     17

In [35]:
frame.to_json()

'{"Name":{"0":"Python","1":"C++"},"Score":{"0":18,"1":17}}'

In [36]:
frame.to_json(orient='values')

'[["Python",18],["C++",17]]'

In [37]:
frame.to_json(orient='index')

'{"0":{"Name":"Python","Score":18},"1":{"Name":"C++","Score":17}}'

In [38]:
frame.to_json(orient='split')

'{"columns":["Name","Score"],"index":[0,1],"data":[["Python",18],["C++",17]]}'

In [39]:
pd.read_json(_, orient='split')

     Name  Score
0  Python     18
1     C++     17

## HTML : Hypertext Markup Language

In [40]:
#pip install lxml

In [41]:
#pip install html5lib

In [42]:
mystr = """
<table>
  <thead>
    <tr>
      <th>name</th>
      <th>score</th>
    </tr>
  </thead> 
  <tbody>
    <tr>
      <td>Ali</td>
      <td>12</td>
    </tr>
    <tr>
      <td>Sara</td>
      <td>18</td>
    </tr>    
   </tbody>   
</table>
"""

In [43]:
lst = pd.read_html(mystr)

In [44]:
lst[0]

   name  score
0   Ali     12
1  Sara     18

In [45]:
r = pd.read_html('d:Files/test.html')
r[0]

   name  score
0   Ali     12
1  Sara     18

In [46]:
r[0].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   score   2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [47]:
u = 'https://en.wikipedia.org/wiki/Minnesota'
x = pd.read_html(u , match='Election results from statewide races')
x[0].head()

   Year     Office    GOP    DFL Others
0  2020  President  45.3%  52.4%   2.3%
1  2020    Senator  43.5%  48.8%   7.7%
2  2018   Governor  42.4%  53.9%   3.7%
3  2018    Senator  36.2%  60.3%   3.4%
4  2018    Senator  42.4%  53.0%   4.6%

## XML  :Extensible Markup Language

In [48]:
from lxml import objectify

In [49]:
f = open('d:Files/book.xml')
r = objectify.parse(f).getroot()
data = []

for i in r.C:
    x = {}
    for c in i.getchildren():
        x[c.tag] = c.pyval
    data.append(x)

In [50]:
pd.DataFrame(data)

      author title  price
0  Shirafkan   C++     60
1       Sara  Java     50

In [51]:
from lxml import etree as et

In [52]:
s = '''
<Book>
<C>
  <author>Shirafkan</author>
  <title>C++</title>
  <price>60</price>
</C>
<C>
  <author>Sara</author>
  <title>Java</title>
  <price>50</price>
</C>
</Book>
'''

In [53]:
root = et.XML(s)

In [54]:
print(len(root))
print(list(root))
print(root.find("C"))

2
[<Element C at 0x1e2ed742640>, <Element C at 0x1e2ef383a80>]
<Element C at 0x1e2ef383a80>

In [55]:
print(et.tostring(root))

b'<Book>\n<C>\n  <author>Shirafkan</author>\n  <title>C++</title>\n  <price>60</price>\n</C>\n<C>\n  <author>Sara</author>\n  <title>Java</title>\n  <price>50</price>\n</C>\n</Book>'

In [56]:
et.tostring(root, xml_declaration=True).decode('utf-8')

"<?xml version='1.0' encoding='ASCII'?>\n<Book>\n<C>\n  <author>Shirafkan</author>\n  <title>C++</title>\n  <price>60</price>\n</C>\n<C>\n  <author>Sara</author>\n  <title>Java</title>\n  <price>50</price>\n</C>\n</Book>"

### PKL file

In [57]:
frame = pd.read_csv('d:Files/score.csv')
frame

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

In [58]:
frame.to_pickle('d:Files/test.pkl')

In [59]:
pd.read_pickle('d:Files/test.pkl')

   name  age  Score
0   Ali   27     19
1  Sara   24     18
2  Taha   25     20
3  Omid   26     13

## Hierarchical Data Format (HDF)

In [60]:
#pip install tables

In [61]:
import tables

In [62]:
mydf = pd.DataFrame({'A': [18, 22], 'B': [3, 15]})
mydf

    A   B
0  18   3
1  22  15

In [63]:
path = 'd:\Files\data.h5'

In [64]:
mydf.to_hdf(path, key='df', mode='w')

In [65]:
pd.read_hdf(path, 'df')

    A   B
0  18   3
1  22  15

## Interacting with Databases

In [66]:
import sqlite3

In [67]:
query = """ CREATE TABLE AgeTable (Name VARCHAR(20), age INTEGER); """

In [68]:
con = sqlite3.connect('d:Files/mydata.sqlite')
con.execute(query)
con.commit()

In [69]:
data = [('Ali', 37), ('Taha', 25), ('Sara', 40)]
q = "INSERT INTO AgeTable VALUES(?, ?)"
con.executemany(q, data)
con.commit()

In [70]:
q = 'select * from AgeTable'
mydata = con.execute(q)
col = [x[0] for x in mydata.description]

In [71]:
pd.DataFrame(mydata.fetchall(), columns=col)

   Name  age
0   Ali   37
1  Taha   25
2  Sara   40

## requests.get

In [72]:
import requests

In [73]:
r = requests.get('https://api.github.com/repos/pandas-dev/pandas/issues')

In [74]:
if r.status_code == 200:
    print('Success!')
elif r.status_code == 404:
    print('Not Found.')

Success!

In [75]:
df = pd.DataFrame(r.json(), columns=['number', 'title'])
df.head()

   number                                              title
0   38750  Iloc truncates single-column dataframe with ex...
1   38749  BUG: TypeError: bad operand type for unary -: ...
2   38746  [WIP] ENH: support downcasting of nullable EAs...
3   38745  [WIP] Test (and more fixes) for duplicate indi...
4   38744         REF/POC: Share groupby/series algos (rank)

to_csv
read_csv

read_table

to_excel
read_excel

to_json
read_json

to_pickle
read_pickle

to_hdf
read_hdf

read_html